Revit 2024 API
ParameterTypeId.FabricationProductDataRange Property
 "Product Range"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationProductDataRange { get; }
Visual Basic
Public Shared ReadOnly Property FabricationProductDataRange As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationProductDataRange {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace